Documents/ОбучениеРазвитиеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбучениеРазвитиеСотрудников</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеРазвитиеСотрудников</xr:Item>
				<xr:Item>Document.ЗаявкаНаОбучениеРазвитие</xr:Item>
				<xr:Item>Document.ПубликацияМероприятияОбученияРазвития</xr:Item>
				<xr:Item>Catalog.МероприятияОбученияРазвития</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбучениеСотрудников</xr:Item>
				<xr:Item>InformationRegister.ФинансовыйУчетОбучениеСотрудников</xr:Item>
				<xr:Item>InformationRegister.ЭлектронныеКурсыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОбучениеРазвитие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПубликацияМероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйЭтапОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговыеБаллы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогрессОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПрогрессаОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерностьПродолжительностиПрогрессаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаЗачета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыЗачетаМероприятийОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОценкиОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийКОценке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговыйБалл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыОтпусков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтпускЯвляетсяЕжегодным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьОтпускВсемСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопительныйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗависимостиДнейОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаОценкиСтажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервалаСтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦелиРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЦелиРазвития</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МероприятияОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбучениеРазвитиеКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриИзмененииПродолжительностиПланаОбучения(Форма, ДополнительныеПараметры = Неопределено,
	СтруктураИменРеквизитов = Неопределено) Экспорт

	Если СтруктураИменРеквизитов = Неопределено Тогда
		СтруктураИменРеквизитов = ОбучениеРазвитиеКлиентСервер.ОписаниеСтруктурыИменРеквизитовПрограммыОбучения();
	КонецЕсли;
	
	ОбучениеРазвитиеКлиентСервер.ПроверитьМаксимальнуюПродолжительностьПланаОбучения(Форма,
		СтруктураИменРеквизитов.ИмяРеквизитаЧислаКолонок);
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("Подключаемый_") Тогда
		Форма.Подключаемый_ПересоздатьКолонкиПериодовПрограммыОбучения();
	Иначе		
		Форма.ПересоздатьКолонкиПериодовПрограммыОбучения();
	КонецЕсли;
	
	ОбучениеРазвитиеКлиентСервер.АктуализироватьНачалоОкончаниеПериодовПрограммыОбучения(Форма, СтруктураИменРеквизитов);
	ОбучениеРазвитиеКлиентСервер.УстановитьЗначенияПериодовПрограммыОбучения(Форма, СтруктураИменРеквизитов);

КонецПроцедуры

Процедура ПрограммаОбученияПриИзменении(Форма, Элемент, ПрограммаОбученияЭлемент, СтруктураИменРеквизитов = Неопределено) Экспорт

	ТекущиеДанные = ПрограммаОбученияЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураИменРеквизитов = Неопределено Тогда
		СтруктураИменРеквизитов = ОбучениеРазвитиеКлиентСервер.ОписаниеСтруктурыИменРеквизитовПрограммыОбучения();
	КонецЕсли;
	
	Если СтрНайти(Элемент.ТекущийЭлемент.Имя, "ПериодПлана") <> 0 Тогда
		ЧислоСтрокой = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "ПериодПлана", "");
		ОбучениеРазвитиеКлиентСервер.ИзменениеПериодовПрограммыОбучения(Форма, ТекущиеДанные, ЧислоСтрокой,
			СтруктураИменРеквизитов);
	КонецЕсли; 

КонецПроцедуры

Процедура ПодобратьМероприятиеПоХарактеристике(Форма, ТекущиеДанные, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если ТекущиеДанные.ВсегоМероприятий = 1 Тогда
		Форма.ДобавитьЕдинственноеМероприятие(ТекущиеДанные.Характеристика);
	Иначе
		ОткрытьПодборМероприятийПоХарактеристикам(Форма, ТекущиеДанные, "ПрограммаОбучения");
	КонецЕсли;

КонецПроцедуры

Процедура ПодобратьЦельРазвитияПоХарактеристике(Форма, ТекущиеДанные, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборЦелейРазвитияПоХарактеристикам(Форма, ТекущиеДанные, "ЦелиРазвития");
	
КонецПроцедуры

Функция ИмяСобытияУстановитьПараметрыФормыОтчета() Экспорт
	Возврат "УстановитьПараметрыФормыОтчета";
КонецФункции

#Область ВариантыОтчетов

// Обработчик широковещательного оповещения формы отчета.
// См. ОтчетыКлиентПереопределяемый.ОбработкаОповещения.
//
Процедура ОбработкаОповещения(ФормаОтчета, ИмяСобытия, Параметр, Источник, ОповещениеОбработано) Экспорт
	
	Если ИмяСобытия = ИмяСобытияУстановитьПараметрыФормыОтчета() Тогда
		
		КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
		ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
		Для Каждого ПараметОтчета Из Параметр.ПараметрыДанных Цикл
			
			ЭлементПараметра = ПараметрыДанных.Элементы.Найти(ПараметОтчета.Ключ);
			
			Если ЭлементПараметра = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПараметОтчета.Значение.Использование Тогда
				ПараметрыДанных.УстановитьЗначениеПараметра(ПараметОтчета.Ключ, ПараметОтчета.Значение.Значение);
			Иначе
				ЭлементПараметра = ПараметрыДанных.Элементы.Найти(ПараметОтчета.Ключ);
				Если ЭлементПараметра <> Неопределено Тогда
					ЭлементПараметра.Использование = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		Попытка
			
			ПараметрыОбновления = ОтчетыКлиентСервер.ПараметрыОбновленияФормыОтчета();
			ПараметрыОбновления.ВариантМодифицирован = Истина;
			ПараметрыОбновления.ОбновитьНастройкиВарианта = Истина;
			ПараметрыОбновления.Переформировать = Истина;
			ПараметрыОбновления.КомпоновщикНастроекКД = КомпоновщикНастроек;
			ФормаОтчета.ПрименитьНастройкиИПереформироватьОтчет(ПараметрыОбновления, Неопределено);
			
			ФормаОтчета.ВариантМодифицирован = Ложь;
			ФормаОтчета.ПользовательскиеНастройкиМодифицированы = Ложь;
			
		Исключение
			ОтчетыКлиент.СформироватьОтчет(ФормаОтчета);
		КонецПопытки;
		
		ОповещениеОбработано = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтатноеРасписание

Процедура ШтатноеРасписаниеПриИзмененииПрограммаОбученияСоответствуютПрофилюДолжности(Форма) Экспорт

	Если Форма.ПрограммаОбученияСоответствуютПрофилюДолжностиЧисло = 1 Тогда
		ЗаполнитьПрограммуОбученияИзПрофиля(Форма);
	КонецЕсли;
	
	ОбучениеРазвитиеКлиентСервер.ШтатноеРасписаниеУстановитьДоступностьЭлементовПрограммыОбучения(Форма);

КонецПроцедуры

Процедура ШтатноеРасписаниеПрофильДолжностиПриИзменении(Форма) Экспорт

	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,
		"ПрограммаОбученияСоответствуютПрофилюДолжностиЧисло") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ПрограммаОбученияСоответствуютПрофилюДолжностиЧисло = 1 Тогда
		Форма.Подключаемый_ЗаполнитьПрограммуОбученияИзПрофиляНаСервере();
	КонецЕсли;

КонецПроцедуры

Процедура ШтатноеРасписаниеРазмерностьПродолжительностьПланаОбученияПриИзменении(Форма) Экспорт
	
	СтруктураИменРеквизитов =
		ОбучениеРазвитиеКлиентСервер.ОписаниеСтруктурыИменРеквизитовПрограммыОбученияШтатногоРасписания();
	ПриИзмененииПродолжительностиПланаОбучения(Форма, Новый Структура("Подключаемый_"), СтруктураИменРеквизитов);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеРазмерностьПродолжительностиПланаОбученияПриИзменении(Форма) Экспорт

	СтруктураИменРеквизитов =
		ОбучениеРазвитиеКлиентСервер.ОписаниеСтруктурыИменРеквизитовПрограммыОбученияШтатногоРасписания();
	ОбучениеРазвитиеКлиентСервер.УстановитьЗаголовкиКолонкамПрограммыОбучения(Форма, СтруктураИменРеквизитов);

КонецПроцедуры

Процедура ШтатноеРасписаниеОткрытьПодборПрограммыОбученияПоХарактеристикам(Форма) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресХарактеристикПерсонала", Форма.Подключаемый_АдресХарактеристикПерсонала());
	СтруктураПараметров.Вставить("АдресПрограммыОбучения", Форма.Подключаемый_АдресПрограммыОбучения());
	Если Форма.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = 1 Тогда
		СтруктураПараметров.Вставить("НедоступныеРеквизиты", Новый Структура("ТребуетсяОбучение"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыФормыПодбора", СтруктураПараметров);
	
	ОткрытьФормуПодбораПрограммыОбучения(Форма, ПараметрыФормы,
		Новый ОписаниеОповещения("Подключаемый_ЗагрузитьПрограммуОбученияНаКлиенте", Форма));

КонецПроцедуры

Процедура ШтатноеРасписаниеПрограммаОбученияПриИзменении(Форма, Элемент) Экспорт
	
	СтруктураИменРеквизитов =
		ОбучениеРазвитиеКлиентСервер.ОписаниеСтруктурыИменРеквизитовПрограммыОбученияШтатногоРасписания();
	ПрограммаОбученияПриИзменении(Форма, Элемент, Форма.Элементы.ПрограммаОбучения, СтруктураИменРеквизитов);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеПрограммаОбученияМероприятиеПриИзменении(Форма) Экспорт
	
	ТекущиеДанные = Форма.Элементы.ПрограммаОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Подключаемый_ЗаполнитьВторичныеДанныеОбученияНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммаОбучения

#КонецОбласти

Процедура ОткрытьФормуПодбораЦелейРазвития(Форма, ДополнительныеПараметры, ОповещениеОЗакрытии = Неопределено) Экспорт

	ПараметрыФормыПодбора = ДополнительныеПараметры.ПараметрыФормыПодбора;
	ДополнительныеПараметры.Удалить("ПараметрыФормыПодбора");
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОповещениеОЗакрытии", ОповещениеОЗакрытии);
	Если ДополнительныеПараметры.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыОповещения, ДополнительныеПараметры);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодборЦелейРазвитияЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("ОбщаяФорма.ПодборЦелейРазвития", ПараметрыФормыПодбора, Форма, Форма.УникальныйИдентификатор, , ,
		Оповещение);

КонецПроцедуры

Процедура ПодборЦелейРазвитияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Или ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеОЗакрытии",
		Неопределено);
	Если ОповещениеОЗакрытии <> Неопределено Тогда
		ДополнительныеПараметры.Удалить("ОповещениеОЗакрытии");
		Если ОповещениеОЗакрытии.ДополнительныеПараметры <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДополнительныеПараметры,
				ОповещениеОЗакрытии.ДополнительныеПараметры);
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения(ОповещениеОЗакрытии.ИмяПроцедуры, ОповещениеОЗакрытии.Модуль,
			ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВводНаОсновании

Функция ДанныеДокументаОбучения(Сотрудник, ИсточникДанных, Организация = Неопределено)
	
	ДанныеДокументаОбучения = Новый Структура;
	ДанныеДокументаОбучения.Вставить("Подразделение", ИсточникДанных.Подразделение);
	ДанныеДокументаОбучения.Вставить("Сотрудник", Сотрудник);
	ДанныеДокументаОбучения.Вставить("ДатаНачала", ИсточникДанных.ДатаНачала);
	ДанныеДокументаОбучения.Вставить("ДатаОкончания", ИсточникДанных.ДатаОкончания);
	ДанныеДокументаОбучения.Вставить("МестоПроведения", ИсточникДанных.МестоПроведения);
	ДанныеДокументаОбучения.Вставить("УчебноеЗаведение", ОбучениеРазвитиеВызовСервера.ЗначениеРеквизитаОбъекта(ИсточникДанных.Мероприятие, "УчебноеЗаведение"));
	ДанныеДокументаОбучения.Вставить("ВидОтпуска", ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускУчебный"));
	ДанныеДокументаОбучения.Вставить("Организация", Организация);

	Возврат ДанныеДокументаОбучения;
	
КонецФункции

Процедура СоздатьПриказ(Форма, ИмяДокумента, ИмяДокументаСписок) Экспорт
	
	Если Форма.Объект.Сотрудники.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В документе не указано ни одного сотрудника.'"));
		Возврат;
	КонецЕсли;
	
	Если Форма.Объект.Ссылка.Пустая() Или Форма.Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
								|Оформление документа возможно только после записи данных.
								|Данные будут записаны.'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСозданиеДокументаПослеЗаписи", ЭтотОбъект,
			Новый Структура("ИмяДокумента, ИмяДокументаСписок, Форма", ИмяДокумента, ИмяДокументаСписок, Форма));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПродолжитьСозданиеДокумента(Форма, ИмяДокумента, ИмяДокументаСписок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьСозданиеДокументаПослеЗаписи(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Форма.Записать() Тогда
			ПродолжитьСозданиеДокумента(
				ДополнительныеПараметры.Форма,
				ДополнительныеПараметры.ИмяДокумента,
				ДополнительныеПараметры.ИмяДокументаСписок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьСозданиеДокумента(Форма, ИмяДокумента, ИмяДокументаСписок)
	
	СотрудникиПоОрганизациям = ОбучениеРазвитиеВызовСервера.СотрудникиПоОрганизациям(Форма.Объект.Ссылка);
	
	ОбработатьСозданиеПриказа(Форма, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, Ложь);
	
КонецПроцедуры

Процедура СоздатьПриказИзСписка(ТекущиеДанные, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, Форма) Экспорт
	
	ОбработатьСозданиеПриказа(Форма, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, Истина, ТекущиеДанные);
	
КонецПроцедуры

Процедура ОбработатьСозданиеПриказа(Форма, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, ИзСписка, ТекущиеДанные = Неопределено)
	
	Если СотрудникиПоОрганизациям.Количество() > 1 Тогда
		
		АдресСотрудниковПоОрганизациям = ПоместитьВоВременноеХранилище(СотрудникиПоОрганизациям, Новый УникальныйИдентификатор);
		ПараметрыФормы = Новый Структура("АдресСотрудниковПоОрганизациям", АдресСотрудниковПоОрганизациям);
	
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяДокумента", ИмяДокумента);
		ДополнительныеПараметры.Вставить("ИмяДокументаСписок", ИмяДокументаСписок);
		ДополнительныеПараметры.Вставить("АдресСотрудниковПоОрганизациям", АдресСотрудниковПоОрганизациям);
		ДополнительныеПараметры.Вставить("СотрудникиПоОрганизациям", СотрудникиПоОрганизациям);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ИзСписка", ИзСписка);
		
		Если ИзСписка Тогда
			ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборОрганизацийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.Форма.ФормаВыбораОрганизаций", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
	ИначеЕсли СотрудникиПоОрганизациям.Количество() = 1 Тогда
	
		ВыбранныеОрганизации = Новый Массив;
		Для Каждого Организация Из СотрудникиПоОрганизациям Цикл
			ВыбранныеОрганизации.Добавить(Организация.Ключ);
		КонецЦикла;
		
		ОбработатьДокументыПоОрганизациям(Форма, ВыбранныеОрганизации, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, ИзСписка, ТекущиеДанные);
	
	Иначе
		
		Если ПолучитьФункциональнуюОпциюИнтерфейса("ОграничиватьДоступНаУровнеЗаписей") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Документы отсутствия уже оформлены или необходимо настроить права доступа.'"))
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Документы отсутствия уже оформлены.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборОрганизацийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресСотрудниковПоОрганизациям);
		Возврат;
	КонецЕсли;
	
	СотрудникиПоОрганизациям = ДополнительныеПараметры.СотрудникиПоОрганизациям;
	ВыбранныеОрганизации = ПолучитьИзВременногоХранилища(Результат);
	
	ТекущиеДанные = ?(ДополнительныеПараметры.ИзСписка, ДополнительныеПараметры.ТекущиеДанные, Неопределено);
	ОбработатьДокументыПоОрганизациям(
		ДополнительныеПараметры.Форма,
		ВыбранныеОрганизации,
		СотрудникиПоОрганизациям,
		ДополнительныеПараметры.ИмяДокумента,
		ДополнительныеПараметры.ИмяДокументаСписок,
		ДополнительныеПараметры.ИзСписка,
		ТекущиеДанные);
		
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресСотрудниковПоОрганизациям);
	
КонецПроцедуры

Процедура ОбработатьДокументыПоОрганизациям(Форма, ВыбранныеОрганизации, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, ИзСписка, ТекущиеДанные)
	
	Основание = ?(ИзСписка, ТекущиеДанные.Ссылка, Форма.Объект.Ссылка);
	ИсточникДанных = ?(ИзСписка, ТекущиеДанные, Форма.Объект);
	
	Для Каждого Организация Из ВыбранныеОрганизации Цикл
		
		МассивСотрудников = СотрудникиПоОрганизациям.Получить(Организация);
		ВидДокумента = ?(МассивСотрудников.Количество() > 1, ИмяДокументаСписок, ИмяДокумента);
		ДанныеДокумента = ДанныеДокументаОбучения(МассивСотрудников, ИсточникДанных, Организация);
		
		ОткрытьФормуДокументаОтсутствия(Форма, ВидДокумента, Основание, ДанныеДокумента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОткрытьФормуДокументаОтсутствия(Форма, ИмяТаблицы, СсылкаНаОснование, ДанныеДокументаОбучения)
	
	Основание = Новый Структура;
	Основание.Вставить("Ссылка", СсылкаНаОснование);
	Основание.Вставить("Действие", "ЗаполнитьИзОбучения");
	Основание.Вставить("ДанныеДокументаОбучения", ДанныеДокументаОбучения);
	
	ПараметрыФормы = Новый Структура("Основание", Основание);
	
	ИмяФормы = СтрШаблон("Документ.%1.ФормаОбъекта", ИмяТаблицы);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, Форма, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ШтатноеРасписание

Процедура ЗаполнитьПрограммуОбученияИзПрофиля(Форма)

	Если Не ЗначениеЗаполнено(Форма.ПрофильДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Форма", Форма);
	
	Если Форма.ПрограммаОбучения.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Программа обучения будет заменена программой из профиля должности.
			|Продолжить?'");
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПрограммуОбученияИзПрофиляЗавершение",
			ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(ОбработчикОповещенияОЗакрытии,ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Продолжить?'"));
	Иначе
		ЗаполнитьПрограммуОбученияИзПрофиляЗавершение(КодВозвратаДиалога.Да, ПараметрыОповещения);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПрограммуОбученияИзПрофиляЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДополнительныеПараметры = Неопределено
		ИЛИ НЕ ДополнительныеПараметры.Свойство("Форма") Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Форма.ПрограммаОбученияСоответствуютПрофилюДолжностиЧисло = 0;
		Возврат;
	КонецЕсли;
	
	Форма.Подключаемый_ЗаполнитьПрограммуОбученияИзПрофиляНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ИзменениеШтатногоРасписания

Процедура ПроверитьЗаполненостьПозиций(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПрограммаОбучения") Тогда
		
		ДополнительныеПараметры = Новый Структура("Форма", Форма);
		
		ТаблицаПозиций = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Позиции");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Позиция", ПредопределенноеЗначение("Справочник.ШтатноеРасписание.ПустаяСсылка"));
		НайденныеСтроки = ТаблицаПозиций.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() <> 0 И НЕ ПараметрыЗаписи.Свойство("ЗаписатьБезПроверки") Тогда
			
			Отказ = Истина;
			
			ТекстВопроса = НСтр("ru = 'Для сохранения информации по новым позициям необходимо выполнить проведение документа,
			|в противном случае данные по ""Программе Обучения"" могут быть потеряны.
			|Провести?'"); 
			
			ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
			ПараметрыВопроса.Заголовок = НСтр("ru = 'Сохранение программы обучения'");
			ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
			ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
			
			КнопкиВопроса = Новый СписокЗначений;
			КнопкиВопроса.Добавить(КодВозвратаДиалога.Да,НСтр("ru = 'Провести'"));
			КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьЗаполненостьПозицийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, ПараметрыВопроса);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполненостьПозицийЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыЗаписи = Новый Структура;
	
	Если РезультатВопроса.Значение = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		Форма.Записать(ПараметрыЗаписи);
	Иначе
		Форма.Записать(Новый Структура("ЗаписатьБезПроверки"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммаОбучения

Процедура ОткрытьФормуПодбораПрограммыОбучения(Форма, ДополнительныеПараметры, ОповещениеОЗакрытии = Неопределено) Экспорт 

	ПараметрыФормыПодбора = ДополнительныеПараметры.ПараметрыФормыПодбора;
	ДополнительныеПараметры.Удалить("ПараметрыФормыПодбора");
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОповещениеОЗакрытии", ОповещениеОЗакрытии);
	Если ДополнительныеПараметры.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыОповещения, ДополнительныеПараметры);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодборПрограммыОбученияЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму("ОбщаяФорма.ПодборМероприятийПоХарактеристикам", ПараметрыФормыПодбора, Форма,
		Форма.УникальныйИдентификатор, , , Оповещение);

КонецПроцедуры

Процедура ПодборПрограммыОбученияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Или ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОповещениеОЗакрытии",
		Неопределено);
	Если ОповещениеОЗакрытии <> Неопределено Тогда
		ДополнительныеПараметры.Удалить("ОповещениеОЗакрытии");
		Если ОповещениеОЗакрытии.ДополнительныеПараметры <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДополнительныеПараметры,
				ОповещениеОЗакрытии.ДополнительныеПараметры);
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения(ОповещениеОЗакрытии.ИмяПроцедуры, ОповещениеОЗакрытии.Модуль,
			ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПодборЦелейРазвитияПоХарактеристикам(Форма, ТекущиеДанные, ИмяРеквизитаЦелиРазвития = "Объект.ЦелиРазвития")
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВсегоЦелей = ТекущиеДанные.ПодобраноЦелей Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("ОтборПоХарактеристике", ТекущиеДанные.Характеристика);
	КонецЕсли;
	
	ТаблицаЦелиРазвитияРеквизит = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,
		ИмяРеквизитаЦелиРазвития);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранныхЦелей", ОбучениеРазвитиеВызовСервера.АдресЦелейРазвития(
		ТаблицаЦелиРазвитияРеквизит, Форма.УникальныйИдентификатор));
	
	ПараметрыОповещения = Новый Структура("Форма, Характеристика", Форма, ТекущиеДанные.Характеристика);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОткрытьПодборЦелейРазвитияПоХарактеристикамЗавершение", ЭтотОбъект,
		ПараметрыОповещения);
	
	ОткрытьФорму("Справочник.ЦелиРазвития.ФормаВыбора", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор, , ,
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьПодборЦелейРазвитияПоХарактеристикамЗавершение(РезультатЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Форма");
	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Характеристика = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Характеристика");
	Форма.ОбработкаПодбораМероприятийПоЦелямНаСервере(РезультатЗакрытия, Характеристика);
	
КонецПроцедуры

Процедура ОткрытьПодборМероприятийПоХарактеристикам(Форма, ТекущиеДанные, ИмяРеквизитаПрограммаОбучения = "Объект.ПрограммаОбучения")
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВсегоМероприятий = ТекущиеДанные.ПодобраноМероприятий Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("ОтборПоХарактеристике", ТекущиеДанные.Характеристика);
	КонецЕсли;
	
	ТаблицаПрограммаОбученияРеквизит = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,
		ИмяРеквизитаПрограммаОбучения);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранныхМероприятий",
		ОбучениеРазвитиеВызовСервера.АдресМероприятийПрограммыОбучения(ТаблицаПрограммаОбученияРеквизит,
		Форма.УникальныйИдентификатор));
	
	ПараметрыОповещения = Новый Структура("Форма", Форма);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОткрытьПодборМероприятийПоХарактеристикамЗавершение", ЭтотОбъект,
		ПараметрыОповещения);
	
	ОткрытьФорму("Справочник.МероприятияОбученияРазвития.ФормаВыбора", ПараметрыОткрытия, Форма,
		Форма.УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьПодборМероприятийПоХарактеристикамЗавершение(РезультатЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Форма");
	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Форма.ОбработкаПодбораМероприятийПоХарактеристикамНаСервере(РезультатЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
